lectures/vscode/vscode_lecture4.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-12 Sat 10:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lecture 3: Git and GitHub - part 2</title>
<meta name="author" content="Jang Soo Kim" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lecture 3: Git and GitHub - part 2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org490a3c0">1. Git for VCS and collaboration</a>
<ul>
<li><a href="#orgbd99e41">1.1. Overview</a></li>
<li><a href="#org548a12b">1.2. Goals</a></li>
<li><a href="#org39a0e19">1.3. Installation</a></li>
<li><a href="#orge8230c7">1.4. Configuring user name and email</a></li>
<li><a href="#orgb14e1a9">1.5. Making a folder as a Git repository</a></li>
<li><a href="#org13fe394">1.6. Commits</a>
<ul>
<li><a href="#org24472be">1.6.1. Definition of commit</a></li>
<li><a href="#orga3d34b2">1.6.2. How to commit</a></li>
<li><a href="#org252cfb0">1.6.3. How to really commit</a></li>
</ul>
</li>
<li><a href="#orgad7e50b">1.7. Branches</a>
<ul>
<li><a href="#orga26dd04">1.7.1. What is a branch?</a></li>
<li><a href="#org59ee666">1.7.2. What branches do I have?</a></li>
<li><a href="#org534cb81">1.7.3. Creating branches</a></li>
<li><a href="#orge76c1a0">1.7.4. Going back to a commit</a></li>
<li><a href="#orgc4aea33">1.7.5. Merging branches</a></li>
</ul>
</li>
<li><a href="#orgd9d646d">1.8. Useful extensions for Git</a></li>
<li><a href="#org547fc1b">1.9. Git commands in VS Code</a>
<ul>
<li><a href="#org71f5eef">1.9.1. </a></li>
</ul>
</li>
<li><a href="#orgfe3a982">1.10. How to use Git for collaboration</a>
<ul>
<li><a href="#orgd4af260">1.10.1. Assumption</a></li>
<li><a href="#orga081d3b">1.10.2. Process</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0a16f73">2. GitHub</a>
<ul>
<li><a href="#org2f8de16">2.1. Overview</a></li>
<li><a href="#org5888321">2.2. Sign up</a></li>
<li><a href="#org862c6a5">2.3. Initiating a remove repository</a></li>
<li><a href="#org370c364">2.4. Pull requests</a></li>
<li><a href="#org2709140">2.5. The easiest work flow (without simultaneous working)</a></li>
<li><a href="#orge4dabce">2.6. The easiest work flow (with simultaneous working but no conflicts)</a></li>
<li><a href="#orgcf5ff97">2.7. The easiest work flow (with simultaneous working)</a></li>
</ul>
</li>
<li><a href="#org3277d84">3. Useful videos</a></li>
<li><a href="#org8ee041f">4. If collaborators don't use GitHub</a>
<ul>
<li><a href="#org5f99ee0">4.1. Exercises</a>
<ul>
<li><a href="#orgf47eaec">4.1.1. Making Git repositories</a></li>
<li><a href="#orgc628121">4.1.2. Commits and push</a></li>
<li><a href="#org4a28d25">4.1.3. Merge</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org490a3c0" class="outline-2">
<h2 id="org490a3c0"><span class="section-number-2">1.</span> Git for VCS and collaboration</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbd99e41" class="outline-3">
<h3 id="orgbd99e41"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Git is a version control system.</li>
<li>We will learn how to use Git for LaTeX.</li>
</ul>
</div>
</div>
<div id="outline-container-org548a12b" class="outline-3">
<h3 id="org548a12b"><span class="section-number-3">1.2.</span> Goals</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Version Control: Keep all versions of your tex file.</li>
<li>Go back to any version if needed.</li>
<li>View the changes in each version.</li>
<li>View the differences between your tex file and your collaborators'.</li>
<li>Merge your tex file with your collaborators'.</li>
</ul>
</div>
</div>
<div id="outline-container-org39a0e19" class="outline-3">
<h3 id="org39a0e19"><span class="section-number-3">1.3.</span> Installation</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Mac
<ul class="org-ul">
<li><p>
Type the following in your terminal will install Git if you don't have it already.
</p>
<pre class="example">
git --version
</pre></li>
<li>See the instruction <a href="https://git-scm.com/book/en/v2/Getting-Started-Installing-Git">here</a> if it doesn't work.</li>
</ul></li>
<li>Windows
<ul class="org-ul">
<li>Download "64-bit Git for Windows Setup" (or 32-bit depending on your
machine) <a href="https://git-scm.com/download/win">here</a>.</li>
<li>Install Git using default settings.</li>
<li>Restart your computer.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge8230c7" class="outline-3">
<h3 id="orge8230c7"><span class="section-number-3">1.4.</span> Configuring user name and email</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><p>
Before using Git you need to identify yourself by entering this.
</p>
<pre class="example">
git config --global user.name "NAME"
git config --global user.email "EMAIL"
</pre></li>
<li>This needs to be done only once.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb14e1a9" class="outline-3">
<h3 id="orgb14e1a9"><span class="section-number-3">1.5.</span> Making a folder as a Git repository</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Open a terminal in the folder you want to make a Git repository.</li>
<li><p>
Enter the following in the terminal.
</p>
<pre class="example">
git init
</pre></li>
<li>This Git repository contains all files in this folder and its sub-folders.</li>
</ul>
</div>
</div>
<div id="outline-container-org13fe394" class="outline-3">
<h3 id="org13fe394"><span class="section-number-3">1.6.</span> Commits</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org24472be" class="outline-4">
<h4 id="org24472be"><span class="section-number-4">1.6.1.</span> Definition of commit</h4>
<div class="outline-text-4" id="text-1-6-1">
<ul class="org-ul">
<li><a href="https://git-scm.com/docs/user-manual">Git manual</a> defines <i>commit</i> as follows.</li>
<li>As a noun: A single point in the Git history; the entire history of a
project is represented as a set of interrelated commits.</li>
<li>As a verb: The action of storing a new snapshot of the project’s state in
the Git history, by creating a new commit representing the current state
of the index and advancing HEAD to point at the new commit.</li>
</ul>
</div>
</div>
<div id="outline-container-orga3d34b2" class="outline-4">
<h4 id="orga3d34b2"><span class="section-number-4">1.6.2.</span> How to commit</h4>
<div class="outline-text-4" id="text-1-6-2">
<ul class="org-ul">
<li>A commit has two parts.</li>
<li>Suppose that you have made some changes in files A, B, C in your project.</li>
<li>Suppose that you want to commit the changes in files A and B.</li>
<li>You first need to <i>add</i> files A and B so that they are <i>staged</i>.</li>
<li>You can then commit these staged files by doing <i>commit</i>.</li>
</ul>
</div>
</div>
<div id="outline-container-org252cfb0" class="outline-4">
<h4 id="org252cfb0"><span class="section-number-4">1.6.3.</span> How to really commit</h4>
<div class="outline-text-4" id="text-1-6-3">
<ul class="org-ul">
<li><p>
To commit changes you first need to "add" your files.
</p>
<pre class="example">
git add FILENAME1 FILENAME2 FILENAME3
</pre></li>
<li>These files are now "staged".</li>
<li><p>
To see the current state enter this.
</p>
<pre class="example">
git status
</pre></li>
<li><p>
To commit the staged files enter this.
</p>
<pre class="example">
git commit -m "COMMIT MESSAGE"
</pre></li>
<li><p>
You can see all commits you have made as follows.
</p>
<pre class="example">
git log
</pre></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgad7e50b" class="outline-3">
<h3 id="orgad7e50b"><span class="section-number-3">1.7.</span> Branches</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orga26dd04" class="outline-4">
<h4 id="orga26dd04"><span class="section-number-4">1.7.1.</span> What is a branch?</h4>
<div class="outline-text-4" id="text-1-7-1">
<ul class="org-ul">
<li><a href="https://git-scm.com/docs/user-manual">Git manual</a> defines <i>branch</i> as follows.</li>
<li>A "branch" is an active line of development. The most recent commit on a
branch is referred to as the tip of that branch. The tip of the branch is
referenced by a branch head, which moves forward as additional development
is done on the branch. A single Git repository can track an arbitrary
number of branches, but your working tree is associated with just one of
them (the "current" or "checked out" branch), and HEAD points to that
branch.</li>
</ul>
</div>
</div>
<div id="outline-container-org59ee666" class="outline-4">
<h4 id="org59ee666"><span class="section-number-4">1.7.2.</span> What branches do I have?</h4>
<div class="outline-text-4" id="text-1-7-2">
<ul class="org-ul">
<li>Your default branch is "master" branch.</li>
<li><p>
To view what branches you have, type this.
</p>
<pre class="example">
git branch
</pre></li>
<li>Your current branch will be marked with *.</li>
<li>By switching between branches you can go back to any state of your
project like a time machine.</li>
</ul>
</div>
</div>
<div id="outline-container-org534cb81" class="outline-4">
<h4 id="org534cb81"><span class="section-number-4">1.7.3.</span> Creating branches</h4>
<div class="outline-text-4" id="text-1-7-3">
<ul class="org-ul">
<li><p>
You can create a branch like this.
</p>
<pre class="example">
git branch BRANCH-NAME
</pre></li>
<li><p>
You can change to the branch "BRANCH-NAME" like this.
</p>
<pre class="example">
git checkout BRANCH-NAME
</pre></li>
<li><p>
You can go back to the master branch.
</p>
<pre class="example">
git checkout master
</pre></li>
<li><p>
You can delete a branch like this.
</p>
<pre class="example">
git branch -d BRANCH-NAME
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orge76c1a0" class="outline-4">
<h4 id="orge76c1a0"><span class="section-number-4">1.7.4.</span> Going back to a commit</h4>
<div class="outline-text-4" id="text-1-7-4">
<ul class="org-ul">
<li><code>git log</code> shows all commits you have made so far.</li>
<li><p>
Suppose that you have the commit number below.
</p>
<pre class="example">
commit 61c261ad4c8c9febd736c7b3bc5da6bf14067f21
</pre></li>
<li>The long and strange string <code>61c261ad4c8c9febd736c7b3bc5da6bf14067f21</code> can
be thought of the name of the "branch" when this commit was made.</li>
<li><p>
So you can go back to the state when this commit was made as you did for
branches.
</p>
<pre class="example">
git checkout 61c261ad4c8c9febd736c7b3bc5da6bf14067f21
</pre></li>
<li><p>
If you want to go back to the current file you can do as follows.
</p>
<pre class="example">
git checkout master
</pre></li>
</ul>
</div>
</div>
<div id="outline-container-orgc4aea33" class="outline-4">
<h4 id="orgc4aea33"><span class="section-number-4">1.7.5.</span> Merging branches</h4>
<div class="outline-text-4" id="text-1-7-5">
<ul class="org-ul">
<li><p>
To merge the current branch with branch "BRANCH-NAME" type this.
</p>
<pre class="example">
git merge BRANCH-NAME
</pre></li>
<li>This will automatically combine the two branches.</li>
<li>However, if there are some conflicts between the two branches you need to
resolve the conflicts first.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd9d646d" class="outline-3">
<h3 id="orgd9d646d"><span class="section-number-3">1.8.</span> Useful extensions for Git</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>GitLens</li>
<li>Git History</li>
</ul>
</div>
</div>

<div id="outline-container-org547fc1b" class="outline-3">
<h3 id="org547fc1b"><span class="section-number-3">1.9.</span> Git commands in VS Code</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-org71f5eef" class="outline-4">
<h4 id="org71f5eef"><span class="section-number-4">1.9.1.</span> </h4>
</div>
</div>
<div id="outline-container-orgfe3a982" class="outline-3">
<h3 id="orgfe3a982"><span class="section-number-3">1.10.</span> How to use Git for collaboration</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<div id="outline-container-orgd4af260" class="outline-4">
<h4 id="orgd4af260"><span class="section-number-4">1.10.1.</span> Assumption</h4>
<div class="outline-text-4" id="text-1-10-1">
<ul class="org-ul">
<li>We assume that (unfortunately) your collaborations do NOT use GitHub.</li>
<li>So you have to do this all by yourself.</li>
<li>You have been working on <code>master</code> branch and you received a modified tex
file from your collaborators.</li>
<li>Let's say your version is A and your collaborators' version is B.</li>
<li>Since A and B are different, you need to combine them together.</li>
</ul>
</div>
</div>
<div id="outline-container-orga081d3b" class="outline-4">
<h4 id="orga081d3b"><span class="section-number-4">1.10.2.</span> Process</h4>
<div class="outline-text-4" id="text-1-10-2">
<ol class="org-ol">
<li>Create a branch, say "B", from the current master branch.</li>
<li>Checkout to that branch.</li>
<li>Replace the content of your tex file with that of version B. (If both
files have the same filename you can simply overwrite your file with your
collaborators' file.)</li>
<li>Commit the changes.</li>
<li>Checkout to the master branch.</li>
<li>Merge version B.</li>
<li>Delete the branch B.</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-org0a16f73" class="outline-2">
<h2 id="org0a16f73"><span class="section-number-2">2.</span> GitHub</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2f8de16" class="outline-3">
<h3 id="org2f8de16"><span class="section-number-3">2.1.</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>GitHub is a platform to share codes with your collaborators.</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org5888321" class="outline-3">
<h3 id="org5888321"><span class="section-number-3">2.2.</span> Sign up</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Sign up here <a href="https://github.com/">https://github.com/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org862c6a5" class="outline-3">
<h3 id="org862c6a5"><span class="section-number-3">2.3.</span> Initiating a remove repository</h3>
</div>
<div id="outline-container-org370c364" class="outline-3">
<h3 id="org370c364"><span class="section-number-3">2.4.</span> Pull requests</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><a href="https://guides.github.com/activities/hello-world/">GitHub Guides</a> say</li>
<li>Pull Requests are the heart of collaboration on GitHub.</li>
<li>And we will NOT use pull requests!</li>
</ul>
</div>
</div>
<div id="outline-container-org2709140" class="outline-3">
<h3 id="org2709140"><span class="section-number-3">2.5.</span> The easiest work flow (without simultaneous working)</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>You wait until your collaborators finish their editing.</li>
<li>Once they are done, they will tell you so (by phone, text message or email).</li>
<li>You now tell them that you start working on the file.</li>
<li>You <b>pull</b> (this will make your file up-to-date).</li>
<li>Make a commit (or two or more).</li>
<li>Push</li>
<li>You tell your collaborators that you are done.</li>
</ol>
</div>
</div>

<div id="outline-container-orge4dabce" class="outline-3">
<h3 id="orge4dabce"><span class="section-number-3">2.6.</span> The easiest work flow (with simultaneous working but no conflicts)</h3>
<div class="outline-text-3" id="text-2-6">
<ol class="org-ol">
<li>You and your collaborators decide to edit particular sections.</li>
<li>For example, you edit Section 1, collaborator A edits Section 2, and
collaborator B edits Section 3.</li>
<li>You <b>pull</b> (this will make your file up-to-date).</li>
<li>Make a commit (or two or more).</li>
<li>Push</li>
<li>If push is not successful, you need to pull and then push. (It will
automatically merge the two files if there are no conflicts.)</li>
</ol>
</div>
</div>

<div id="outline-container-orgcf5ff97" class="outline-3">
<h3 id="orgcf5ff97"><span class="section-number-3">2.7.</span> The easiest work flow (with simultaneous working)</h3>
<div class="outline-text-3" id="text-2-7">
<ol class="org-ol">
<li>Pull (this will make up-to-date).</li>
<li>Make a commit (or two or more).</li>
<li>Push and you will see a message saying that you need to pull first.</li>
<li>So pull. Then you will see a message saying that you need to resolve conflicts.</li>
<li>Click your file in the source control sidebar.</li>
<li>Then you can resolve the conflicts by choosing the changes you like to
keep.</li>
<li>Commit your change and push.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org3277d84" class="outline-2">
<h2 id="org3277d84"><span class="section-number-2">3.</span> Useful videos</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Learn Git In 15 Minutes
<a href="https://www.youtube.com/watch?v=USjZcfj8yxE">https://www.youtube.com/watch?v=USjZcfj8yxE</a></li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org8ee041f" class="outline-2">
<h2 id="org8ee041f"><span class="section-number-2">4.</span> If collaborators don't use GitHub</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>You can still do the same thing even if your collaborators do not use GitHub.</li>
<li>But you have to use "branches".</li>
<li>When you make changes you push as usual.</li>
<li>Whenever your collaborator sends you their file do the following.
<ol class="org-ol">
<li>Make sure that their file has the same name as yours in GitHub.</li>
<li>Upload their file in the GitHub repository.</li>
<li>You pull in VS Code.</li>
<li>If there are conflicts you can merge as before.</li>
</ol></li>
</ul>
</div>
<div id="outline-container-org5f99ee0" class="outline-3">
<h3 id="org5f99ee0"><span class="section-number-3">4.1.</span> Exercises</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgf47eaec" class="outline-4">
<h4 id="orgf47eaec"><span class="section-number-4">4.1.1.</span> Making Git repositories</h4>
<div class="outline-text-4" id="text-4-1-1">
<ol class="org-ol">
<li>Download this file and extract it in your computer.</li>
<li>Compile the tex file.</li>
<li>Make this folder a local repository and create a remote repository (Hint: "Publish to GitHub")</li>
<li>Select only the tex file when you do this.</li>
</ol>
</div>
</div>
<div id="outline-container-orgc628121" class="outline-4">
<h4 id="orgc628121"><span class="section-number-4">4.1.2.</span> Commits and push</h4>
<div class="outline-text-4" id="text-4-1-2">
<ol class="org-ol">
<li>Write contents in Section 4.</li>
<li>Commit your changes with commit message "Add contents in Section 4" (the
tex file only).</li>
<li>Push.</li>
<li>Check Git History and see the changes that you just made.</li>
<li>Repeat the same thing with Section 5.</li>
<li>Correct Corollary 3.1 and commit and push.</li>
</ol>
</div>
</div>

<div id="outline-container-org4a28d25" class="outline-4">
<h4 id="org4a28d25"><span class="section-number-4">4.1.3.</span> Merge</h4>
<div class="outline-text-4" id="text-4-1-3">
<ol class="org-ol">
<li>Your collaborator just sent you their tex file. This is in the folder "from your collaborator".</li>
<li>Change the file name of this file to "git-test.tex" so that it's the same as our tex file name.</li>
<li>Visit your GitHub repository and upload their tex file and commit there.</li>
<li>Go back to your VS Code and pull.</li>
<li>Resolve the conflicts.</li>
<li>Commit and push.</li>
<li>Check Git History and see the changes that you just made.</li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jang Soo Kim</p>
<p class="date">Created: 2022-02-12 Sat 10:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
